import styled from "styled-components";
import {forwardRef} from "react";
import {numberInWordsMkd} from "../utils/numberInWordsMkd.js";


const DogovorZaRacenZalog = forwardRef((
    { fullName, city, address, embg, idCard, telephone, moneyGiven, pawnDays, dateFrom, dateTo, pawnInfo },
    ref) => {

    return (
        <Section ref={ref}>
            <p>Врз основ на цлен 2, 3, 4, 14, 18, 23, 25, 29, 30, 32, 33 и 41 од Законот за договорен залог (Сл.весник на
                РСМ бр.05/03, со сите негови измени и дополнувања), на ден {dateFrom} година, во Скопје, се склучува
                следниот:</p>
            <h1>ДОГОВОР ЗА РАЧЕН ЗАЛОГ</h1>
            <p>Помеѓу следните договорни страни:</p>
            <p><span className="bold">1. Друштво за услуги ВОЛТЕР А&Б ДООЕЛ Скопје</span>, со седисте на ул. Булевар
                Партизански одреди бр.17-4, Скопје - Центар, со ЕДБ 4080019581460 и ЕМБС 7349750, застапувано од овластено лице Александар Коцевски, Управител,
                (во понатамосниот текст: <span className="bold">Заложен доверител</span>), и</p>
            <p><span className="bold">2. {fullName}</span>, со зивеалиште на {address}, град {city}, со ЕМБГ {embg} и л.к.бр. {idCard} издадена од МВР Скопје, Контакт {telephone},
                (во понатамошниот текст: <span className="bold">Заложен должник</span>).</p>
            <Clen>
                <p className="bold">Член 1</p>
                <p>Предмет на овој Договор за рачен залог (во понатамошниот текст: Договорот) е засновање на договорно
                    заложно право врз подвижна ствар - <span className="bold">рачен залог</span>, со кој се обезбедува парично побарување на Заложниот доверител
                    во износ од {moneyGiven} денари кое го има врз Заложниот должник врз основа на Договор за заем бр._______________
                    од {dateFrom} година (во понатамошниот текст: Договор за заем), со рок на пристигнатост на побарувањето на ден {dateTo} година.
                    Рачниот залог се заснова со предавање на предметот на овој Договор во владение на Заложниот доверител (владетелски залог).
                    Заложниот доверител се стекнува со правото на залог во моментот на склучување на овој Договор и со истовремено предавање на предметот на залог во владение на Заложниот доверител.
                    Со залог се оптоварува целиот предмет на залогот.</p>
            </Clen>
            <Clen>
                <p className="bold">Член 2</p>
                <p>Предмет на залог е: {pawnInfo}, со проценета вредност во паричен износ од {moneyGiven} денари.
                    Договорните страни се согласни дека залогот опишан во став 1 на овој член е детално и прецизно идентификуван
                    со доволно податоци кои неспорно ја докажуваат неговата посебност и одреденост, и согласни се дека проценетата
                    вредност на заложниот предмет е взаемно определена и претставува договорена вредност на предметот на залог во
                    моментот на склучување на овој Договор.</p>
            </Clen>
            <Clen style={{ marginBottom: "160px" }}>
                <p className="bold">Член 3</p>
                <p>Доколку побарувањето кое е обезбедено со залогот - предмет на овој Договор не биде исполнето во рокот
                    на неговата пристигнатост назначен во Договорот за заем, Заложниот доверител може да го намири своето
                    побарување од вредноста на предметот на залогот или да се стекне со право на сопственост врз предметот на
                    залогот <span className="bold">(леx цоммиссориа)</span>.
                    Заложниот должник е изречно согласен во случај да не го подмири во целост побарувањето кое е обезбедено
                    со залогот - предмет на овој Договор во рокот на неговата пристигнатост назначен во Договорот за заем, <span className="bold">да
                        може Заложникот доверител да го продаде предметот на залог</span> по сопствено наоѓање со непосредна спогодба
                    со трето лице или <span className="bold">да се стекне со право на сопственост врз предметот на залог</span> и да располага со истиот како
                    единствен и неспорен сопственик со сите права кои му следуваат согласно позитивните законски прописи.
                    Доколку постои позитивна разлика помеѓу износот на вредноста на заложениот предмет наведена во член 2 на
                    овој Договор и постигнатата купопродажна цена во договорот за купопродажба на подвизен имот со кој Залозниот
                    доверител ќе го продаде заложениот предмет на трето лице, истата ќе уплати на сметката на Залозниот доверител како
                    прилив на дневен промет и истата е подложна на данок на добивка.</p>
            </Clen>
            {/*PROVERI TUKA*/}
            <Clen>
                <p className="bold">Член 4</p>
                <p>Заложниот должник под полна морална, материјална и кривична одговорност со потпишување на овој Договор и со
                    посебна изјава потврдува и гарантира дека е единствен и неспорен сопственик на предметот на залог и дека истиот
                    нема никакви законски пречки да биде во правниот промет. <span className="bold">(Прилог бр.1)</span>
                    Заложниот должник под истата целосна одговорност наведена во став 1 на овој член потврдува и гарантира
                    дека предметот на залог го стекнал во своја сопственост по легален пат, а во спротивно ја исклучува одговорноста
                    на Заложниот доверител да сноси законски последици доколку предметот на залог претходно го има стекнато на
                    противправен начин. (<span className="bold">Прилог бр.2</span>, доколку Заложниот должник поседува доказ за стекнување на сопственоста)
                    Во случај на прекршување на одредбите од став 1 и став 2 на овој член, се смета дека овој Договор не
                    произведува правно дејство и Заложниот доверител има право да го наплати своето побарување со друг подвизен и
                    недвизен имот во сопственост на Заложниот должник.</p>
            </Clen>
            <Clen>
                <p className="bold">Член 5</p>
                <p>Страните се согласни дека Заложниот доверител во случај на доцнење од страна на Заложниот должник да може
                    да превзема заштитни мерки во однос на залогот, со цел да се зачува, одржи или зголеми пазарната вредност на
                    предметот на залог, и истиот има право на надомест кој дополнително би се утврдил врз основа на реалните трошоци кои ќе
                    ги има Заложниот доверител за чување на предметот на залог во сопствениот објект кој е сигурносно обезбеден и
                    заштитен од агенција за обезбедување или во сеф, во зависност од габаритноста на предметот и по проценка на договорните страни.
                    Заложниот доверител исто така има право на:
                    - <span className="bold">месечен надомест за чување</span> во висина од % од вредноста на заложениот предмет;
                    - <span className="bold">трошоци за проценка на вредноста на заложениот предмет</span> во висина од % од вредноста на заложениот предмет;
                    - <span className="bold">трошоци за разгледување и одобрување на заемот</span> во висина од % од вредноста на заемот.
                    Заложниот должник изречно се согласува и ги прифаќа горенаведените надоместоци и трошоци како фер и коректен
                    начин за надомест на реалните трошоци кои ќе ги има Заложниот доверител.</p>
            </Clen>
            <Clen>
                <p className="bold">Член 6</p>
                <p>Договорните страни го утврдуваат максималниот износ на побарувањето кое се обезбедува со предметот на
                    залог во висина од проценетата вредност на заложениот предмет определена во чл.2 ст.1 на овој Договор, кој износ
                    претставува збир од главните побарувања зголемени за износот на договорната камата, казнената камата,
                    провизиите и другите трошоци кои произлегуваат по основ на Договорот за заем.
                    Делот на побарувањето на Заложниот доверител во износ поголем од договорениот максимален износ
                    назначен во став 1 на овој член, ќе се смета како необезбедено побарување.</p>
            </Clen>
            <Clen>
                <p className="bold">Член 7</p>
                <p>Заложниот доверител е должен да го чува заложениот предмет со внимание на добар домаќин.
                    Заложниот доверител е должен да го врати заложениот предмет штом ќе му биде намирано побарувањето
                    во целост, за што издава Потврда за враќање на заложен предмет <span className="bold">(Прилог бр.3)</span>.
                    Заложниот доверител нема право да го употребува заложениот предмет или да му го предаде на употреба
                    на друг, или да го стави во подзалог, освен со согласност на Заложниот должник.
                    Заложниот доверител не одговара за целосно или делумно уништување на заложениот предмет поради виша сила
                    (поплава, пожар, земјотрес) или резултат на дејство на топла, воена или вонредна состојба.</p>
            </Clen>
            <Clen style={{ marginBottom: "80px" }}>
                <p className="bold">Член 8</p>
                <p>Доколку се покаже дека предметот на залог има некој правен или материјален недостаток, Заложниот должник
                    на барање на Заложниот доверител, е должен веднаш а најдоцна во рок од 7 дена да го ослободи предметот на залог
                    од тој недостаток, а во спротивно има обврска да го замени со друг предмет.
                    Покрај правото наведено во став 1 на овој член, Заложниот доверител може и пред пристигнувањето на своето
                    побарување да бара негова наплата од предметот на залог, доколку Заложниот должник не постапи на начин или во рок
                    утврден во овој член, а исто такво право Заложниот доверител има и доколку Заложниот должник презема или пропушта
                    дејствија поради кои се доведува во опасност или очигледно се намалува вредноста на предметот.
                    Заложниот должник е должен на Заложниот доверител <span className="bold">да му ја најави намерaта за подигнување на заложениот
                    предмет најмалку еден ден однапред</span>, при целосна исплата на пристигнатото побарување.</p>
            </Clen>
            <Clen>
                <p className="bold">Член 9</p>
                <p>Заложното право засновано со овој договор престанува поради: исполнување на обврската од страна на
                    Заложниот должник; истек на определеното време; пропаѓање на заложениот предмет поради виша сила; губење на
                    владеењето на заложениот предмет; продажба на предметот заради реализација на заложното право; раскинување на
                    Договорот за залог; и под други услови определени со закон.</p>
            </Clen>
            <Clen>
                <p className="bold">Член 10</p>
                <p>Согласно одредбите од Законот за договорен залог, за заложното право засновано врз основа на овој
                    Договор, како право на рачен и владетелски залог, <span className="bold">не се врши упис на залогот во Заложниот регистар</span> кој го води
                    Централниот регистар на РСМ.</p>
            </Clen>
            <Clen>
                <p className="bold">Член 11</p>
                <p>Согласно чл.6 од Законот за заштита на личните податоци, обработката на личните податоци на Заложниот
                    должник се врши само поради целите на склучување на овој Договор во кој истиот се јавува како договорна страна и
                    негова изречна и претходно добиена согласност која ја потврдува со ставање на својот потпис во овој Договор.</p>
            </Clen>
            <Clen>
                <p className="bold">Член 12</p>
                <p>Во случај на спор, страните се согласни за месно надлежен да се смета Основен Граѓански суд Скопје.
                    За сè што не е регулирано со овој договор, ќе се применуваат одредбите од Законот за договорен залог,
                    Законот за облигационите односи, и другите позитивни прописи во РСМ.
                    <span className="bold">Прилозите и анексите се сметаат за составен дел на овој Договор.</span></p>
            </Clen>
            <Clen>
                <p className="bold">Член 13</p>
                <p>Договорните страни го склучуваат овој договор во состојба на здрав разум и чиста свест, со слободно
                    изразена волја, добро се запознаени со неговата содржина и значење, го признаваат за точен и непоколеблив израз
                    на нивната војла и за сè погоре наведено сведочат со своерачни потписи.
                    Договорните страни се согласни евентуалните трошоци поврзани со склучување на овој Договор да паднат
                    на товар на Заложниот должник.</p>
            </Clen>
            <Clen>
                <p className="bold">Член 14</p>
                <p>Овој договор е составен од 14 членови на 2 листа испечатени на двете страни, потпишан на секој лист од двете
                    договорни страни, и е склучен во 2 идентични примероци, од кои по 1 за секоја договорна страна.</p>
            </Clen>
            <h2>ДОГОВОРНИ СТРАНИ</h2>
            <div>
                <Clen>
                    <h3>ЗАЛОЖЕН ДОВЕРИТЕЛ</h3>
                    <p>______________________</p>
                    <h4>Волтер А&Б ДООЕЛ Скопје</h4>
                    <h4>ЕДБ 4080019581460 и ЕМБС 7349750</h4>
                    <h4>Александар Коцевски, Управител</h4>
                </Clen>
                <Clen>
                    <h3>ЗАЛОЖЕН ДОЛЖНИК</h3>
                    <p>______________________</p>
                    <h4>{fullName}</h4>
                </Clen>
            </div>
        </Section>
    )
})

export default DogovorZaRacenZalog;

const Section = styled.div`
    display: flex;
    flex-direction: column;
    align-items: center;
    padding: 50px 20px;
    gap: 1rem;
    
    & h1 {
        font-size: 18px;
    }
    h2 {
        font-size: 14px;
    }
    & h3 {
        font-size: 12px;
        margin-bottom: 10px;
    }
    & h4 {
        font-size: 12px;
    }
    & p {
        font-size: 12px;
    }
    
    & > div {
        width: 100%;
        display: flex;
        justify-content: space-between;
    }
    
    & .bold {
        font-weight: bold;
    }
`

const Clen = styled.div`
    display: flex;
    flex-direction: column;
    align-items: center;
`