import styled from "styled-components";
import {forwardRef} from "react";
import {numberInWordsMkd} from "../utils/numberInWordsMkd.js";


const DogovorZaZaem = forwardRef((
    { fullName, city, address, embg, idCard, telephone, moneyGiven, pawnDays, dateFrom, dateTo },
    ref) => {

    const moneyGivenToString = numberInWordsMkd(moneyGiven)
    const pawnDaysToString = numberInWordsMkd(pawnDays)

    return (
        <Section ref={ref}>
            <h1>ДОГОВОР ЗА ЗАЕМ</h1>
            <p>Склучен во Скопје, на ден {dateFrom} година, помеѓу следните договорни страни:</p>
            <p><span className="bold">1. Друштво за услуги ВОЛТЕР А&Б ДООЕЛ Скопје</span>, со седиште на ул. Булевар
                Партизански одреди бр.17-4, Скопје-Центар, со ЕДБ 4080019581460 и ЕМБС 7349750, застапувано од овластено лице Александар Коцевски, Управител,
                (во понатамошниот текст: <span className="bold">Заемодавач</span>), и</p>
            <p><span className="bold">2. {fullName}</span>, со живеалиште на {address}, град {city}, со ЕМБГ {embg} и л.к.бр. {idCard} издадена од МВР Скопје, Контакт {telephone},
                (во понатамошниот текст: <span className="bold">Заемопримач</span>).</p>
            <Clen>
                <p className="bold">Член 1</p>
                <p>Предмет на овој Договор е уредување на односите помеѓу договорните страни во врска со заем на парични
                    средства кои Заемодавачот му ги дава на Заемопримачот, а Заемопримачот се обврзува дека истите ќе ги
                    врати во рок и на начин како што е договорено со овој Договор.</p>
            </Clen>
            <Clen>
                <p className="bold">Член 2</p>
                <p>Заемодавачот му дава на Заемопримачот износ од {moneyGiven} <span className="bold">денари</span> (со букви: {moneyGivenToString}).
                    Заемопримачот горенаведениот износ ќе го користи за сопствени потреби со <span className="bold">договорна камата од 1%</span> (еден процент) на горенаведениот износ.</p>
            </Clen>
            <Clen>
                <p className="bold">Член 3</p>
                <p>Заемодавачот го дава, а Заемопримачот го прима заемот опишан од членот 2 на овој Договор под следниве
                    услови:
                    - рок на отплата од {pawnDays} <span className="bold">дена</span> (со букви: {pawnDaysToString} дена),
                    сметано од ден {dateFrom} година, заклучно со {dateTo} година, најдоцна до 16.00 часот истиот ден;
                    - со секоја отплата се плаќа и договорената камата од 1% на целокупниот заем.
                    За секој ден на задоцнување, на сите достасани, а ненаплатени побарувања по основ на заемот од член
                    2 на овој договор, Заемодавачот ќе пресметува и наплаќа законска казнена камата согласно чл.266-а од
                    Законот за облигационите односи, од денот на достасување до денот на наплатата.</p>
            </Clen>
            <Clen>
                <p className="bold">Член 4</p>
                <p>Заемодавачот му го дава заемот на Заемопримачот непосредно пред склучување на овој Договор на
                    рака, кое нешто го потврдува Заемопримачот со својот потпис на овој Договор.
                    Како обезбедување на побарувањето на Заемодавачот, односно гаранција за навремена и целосна
                    исплата на долгот по основ на заемот предмет на овој Договор, Заемопримачот веднаш по склучувањето на овој
                    За наведеното во став 2 на овој член помеѓу истите страни се склучува и договор за рачен владетелски
                    Договор му предава на рака на Заемодавачот свој подвизен предмет во рачен и владетелски залог.
                    За наведеното во став 2 на овој член помеѓу истите страни се склучува и договор за рачен владетелски
                    залог на подвизен имот.</p>
            </Clen>
            <Clen>
                <p className="bold">Член 5</p>
                <p>Доколку, Заемопримачот задоцни со плаќање на заемот во рокот определен во член 3 на овој Договор,
                    заемот ќе се смета за достасан во целост и Заемодавачот ќе има право да бара исплата на целиот заем веднаш или
                    присилна наплата на своето побарување. Во случај на делумно вратен заем, предмет на побарување ќе претставува разликата од исплатениот дел до
                    вкупната обврска, заедно со сите договорни и казнени камати, како и трошоците кои ќе ги има
                    Заемодавачот во и поврзани со постапката за присилна наплата.</p>
            </Clen>
            <Clen style={{marginBottom: "80px"}}>
                <p className="bold">Член 6</p>
                <p>Евентуалните промени на роковите на отплата или целосно враќање на заемот или ослободување од договорните
                    обврски пред целосна исплата на заемот или други елементи на овој договор, по согласност на двете страни ќе се
                    регулираат со <span className="bold">Анекс</span> на овој договор потпишан од двете страни, кој ќе биде составен дел на истиот.</p>
            </Clen>
            <Clen>
                <p className="bold">Член 7</p>
                <p>Заемопримачот изречно се согласува и изјавува, доколку не ја исполни обврската и навремено и целосно
                    не ги врати примените парични средства на име заем, на начин како што е регулирано во член 3 и 5 на овој Договор,
                    <span className="bold">дека е согласен Заемодавачот може да до наплати своето пристигнато побарување со продажба на
                    заложениот предмет</span> предаден во рачен и владетелски залог врз основа на Договор за рачен залог или
                    преминување на сопственоста врз предметот на Заемодавачот од моментот на плаќањето во доцнење.</p>
            </Clen>
            <Clen>
                <p className="bold">Член 8</p>
                <p>Во случај на спор, страните се согласни за месно надлежен да се смета Основниот Граѓански суд Скопје.
                    За се што не е предвидено со овој договор, ќе се применува Законот за облигационите односи и другите позитивни прописи во РСМ.
                    <span className="bold">Приложите и анексите се сметаат за составен дел на овој Договор.</span></p>
            </Clen>
            <Clen>
                <p className="bold">Член 9</p>
                <p>Согласно ч.6 од Законот за заштита на личните податоци, обработката на личните податоци на Заемопримачот
                    се врши само поради целите на склучување на овој Договор во кој истиот се јавува како договорна страна и негова
                    изречна и претходно добиена согласност која ја потврдува со ставање на својот потпис во овој Договор.</p>
            </Clen>
            <Clen>
                <p className="bold">Член 10</p>
                <p>Договорните страни го склучуваат овој договор во состојба на здрав разум и чиста свест, со слободно
                    изразена волја, добро се запознаени со неговата содржина и значење, го признаваат за точен израз на својата
                    непоколеблива волја и за сето погоре наведено сведочат со своерачни потписи.
                    Договорните страни се согласни трошоците поврзани со склучување на овој Договор да паднат на товар на Заемопримачот.</p>
            </Clen>
            {/*IMASE 2 CLEN-5 PA GI AZURIRAV*/}
            <Clen>
                <p className="bold">Член 11</p>
                <p>Овој договор е составен од 11 членови на 2 листа испечатени на двете страни, потпишан од двете договорни
                    страни, и е склучен во 2 идентични примероци, од кои по 1 за секоја договорна страна.</p>
            </Clen>
            <h2>ДОГОВОРНИ СТРАНИ</h2>
            <div>
                <Clen>
                    <h3>ЗАЕМОДАВАЧ</h3>
                    <p>______________________</p>
                    <h4>Волтер А&В ДООЕЛ Скопје</h4>
                    <h4>ЕДБ 4080019581460 и ЕМБС 7349750</h4>
                    <h4>Aлександар Коцевски, Управител</h4>
                </Clen>
                <Clen>
                    <h3>ЗАЕМОПРИМАЧ</h3>
                    <p>______________________</p>
                    <h4>{fullName}</h4>
                </Clen>
            </div>

        </Section>
    )
})

export default DogovorZaZaem;

const Section = styled.div`
    display: flex;
    flex-direction: column;
    align-items: center;
    padding: 50px 20px;
    gap: 1rem;

    & h1 {
        font-size: 18px;
    }
    h2 {
        font-size: 14px;
    }
    & h3 {
        font-size: 12px;
        margin-bottom: 10px;
    }
    & h4 {
        font-size: 12px;
    }
    & p {
        font-size: 12px;
    }

    & > div {
        width: 100%;
        display: flex;
        justify-content: space-between;
    }

    & .bold {
        font-weight: bold;
    }
`

const Clen = styled.div`
    display: flex;
    flex-direction: column;
    align-items: center;
`