import styled from "styled-components";
import {forwardRef} from "react";


const PotvrdaZaVratenPredmet = forwardRef((
    { fullName },
    ref) => {
    return (
        <Section ref={ref}>
            <h1>Потврда за враќање на заложен предмет</h1>
            <p>Јас, долупотпишаниот/та во својство на Заложен должник во Договор за рачен залог чиј составен дел е овој Прилог, на денот на склучувањето на Договорот,
                <span className="bold"> под полна морална, материјална и кривична одговорност, ПОТВРДУВАМ</span> дека подвижната ствар од чл.2 на Договорот, која ја
                предадов како <span className="bold">заложен предмет</span> во рачен владетелски залог на Заложниот доверител: <span className="bold">Друштво за услуги ВОЛТЕР А&Б ДООЕЛ Скопје</span>, со седиште на ул. Булевар Партизански одреди бр.17-4,
                Скопје-Центар, со ЕДБ 4080019581460 и ЕМБС 7349750 застапувано од овластено лице Александар Коцевски Управител,
                по целосно подмирување на побарувањето, односно исплата на заемот, <span className="bold">ми се враќа назад во сопственост и владение</span> од страна на Заложниот доверител,
                во истата состојба во која што му го предадов заложениот предмет.</p>
            <p>Дополнителни рекламации за состојбата, својствата и функционалноста на заложениот предмет нема да истакнувам, поради фактот што на денот на враќањето на предметот се уверив лично и
                непоколебливо дека истиот е во идентична состојба со онаа во која што е предаден во залог.</p>
            <p>Оваа потврда да му послужи на Заложниот доверител во случај истиот да има потреба да докаже пред мене, трето лице или надлежен орган дека заложениот предмет не е повеќе во негово владение, односно ми е вратен.</p>
            <p>Се согласувам доказот да се прикачи кон овој Прилог и кон Договорот за рачен залог и да стане негов составен дел.</p>
            <div>
                <Clen>
                    <h2>ЗАЛОЖЕН ДОЛЖНИК</h2>
                    <p>______________________</p>
                    <h2>{fullName}</h2>
                </Clen>
            </div>

        </Section>
    )
})

export default PotvrdaZaVratenPredmet;

const Section = styled.div`
    display: flex;
    flex-direction: column;
    align-items: center;
    padding: 50px 50px;
    gap: 1rem;

    & h1 {
        font-size: 18px;
    }
    & h2 {
        font-size: 16px;
    }
    & h3 {
        font-size: 12px;
        margin-bottom: 10px;
    }
    & h4 {
        font-size: 12px;
    }
    & p {
        font-size: 12px;
    }

    & > div {
        width: 100%;
        display: flex;
        justify-content: flex-end;
    }

    & .bold {
        font-weight: bold;
    }
`

const Clen = styled.div`
    display: flex;
    flex-direction: column;
    align-items: center;
    margin-left: auto;
`